src/2024-02-04-boox-palma.org
#+TITLE: BOOX Palma を購入しました
#+DATE: <2024-02-04 Sun>

* 背景

[[https://rebuild.fm/378/][Rebuild #378]] で触れられていた [[https://sktgroup.co.jp/boox-palma/][BOOX Palma]] を購入してしまいました。動画再生すらできてしまう新世代の E-Ink 端末という印象です。

** E-Ink は目に優しいのか？

E-Ink 端末はフロントライトを採用します。フロントライトは E-Ink よりもユーザに向かって手前にあり、反射光をユーザに見せる仕組みらしいです。これならリビングの光と同じ……？

#+BEGIN_SRC txt
 E-Ink     Front light         Eye
 .           |
 . <------- *|
 . ----------+-----------------> o
 .           |
#+END_SRC

逆にバックライト方式では液晶の透過光が目に届くため、目が疲れやすいとか。 E-Ink と眼精疲労の関係を調べた論文もあるようなので、暇があれば読んでみます。

** BOOX Palma の主なスペック

音声再生やテキストの表示アプリとしては十分な性能です。

| 項目       | 値                       |
|------------+--------------------------|
| 画面サイズ | 6.13 インチ (横 1 : 縦 2) |
| 解像度     | 824x1,648 (300 dpi)      |
| ROM        | 128 GB                    |
| RAM        | 6 GB                      |
| 重量       | 170g                     |
| バッテリー | 3950 mAh                 |
| 防水       | 無し                     |

※ Wifi のみ

* 使用感

** ハード面

バッテリー以外は問題無さそうです。

| 項目           | 一言                           |
|----------------+--------------------------------|
| バッテリー     | 5 時間持つ (らしい)            |
| 画像表示       | 縮小されて汚い                 |
| スピーカー     | 長時間聴くには堪えない         |
| キーボード接続 | TODO                           |
| Bluetooth 接続  | Shokz の物理ボタンが動作する ※ |

※ ただしソフトが再生切り替えボタンに対応していない？

** メディア

テキストには強いのですが、音声関連はイマイチでした。

| 項目     | 一言                 |
|----------+----------------------|
| IME      | gboard でフリック入力 |
| 読み上げ | やりにくい (Talkback) |
| 音声入力 | TODO                 |

** アプリケーション

読み上げは快適ではなかったため、テキストに専念しました。特に [[https://github.com/plateaukao/einkbro][einkbro]] のおかげで快適にブラウジングできるようになり、活用の幅が広がりました。

| 用途            | 使用アプリ |
|-----------------+------------|
| Web ブラウジング | [[https://github.com/plateaukao/einkbro][einkbro]]     |
| Web 小説         | [[https://makimaru.r401.net/][巻丸3]]      |
| epub             | Boox Reader |
| Kindle           | Kindle      |
| Termux           | Termux      |

* 感想

とにかくナビゲーションが軽快で、文字の表示も美しいです。 Web 記事や小説類は、すべてこの端末で読むことになりそうです。

スピーカーは良くありません。読み上げもやりづらく、テキスト表示の専用デバイスとして使うことにします。動画や音声には iPad を使います。

