2024-02-04-boox-palma.html
<!DOCTYPE html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>BOOX Palma を購入しました - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1>BOOX Palma を購入しました</h1>
      <p>Feb 4, 2024</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="背景"><a href="#背景">背景</a></h2>
      <p>
        <a href="https://rebuild.fm/378/">Rebuild #378</a> で触れられていた
        <a href="https://sktgroup.co.jp/boox-palma/">BOOX Palma</a>
        を購入してしまいました。動画再生すらできてしまう新世代の E-Ink 端末という印象です。<br />
      </p>

      <h3 id="E-Ink は目に優しいのか？">
        <a href="#E-Ink は目に優しいのか？">E-Ink は目に優しいのか？</a>
      </h3>
      <p>
        E-Ink 端末はフロントライトを採用します。フロントライトは E-Ink
        よりもユーザに向かって手前にあり、反射光をユーザに見せる仕組みらしいです。これならリビングの光と同じ……？<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-txt"> E-Ink     Front light         Eye
 .           |
 . &lt;------- *|
 . ----------+-----------------&gt; o
 .           |
</code></pre>
      </div>

      <p>
        逆にバックライト方式では液晶の透過光が目に届くため、目が疲れやすいとか。 E-Ink
        と眼精疲労の関係を調べた論文もあるようなので、暇があれば読んでみます。<br />
      </p>

      <h3 id="BOOX Palma の主なスペック">
        <a href="#BOOX Palma の主なスペック">BOOX Palma の主なスペック</a>
      </h3>
      <p>音声再生やテキストの表示アプリとしては十分な性能です。<br /></p>

      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">項目</th>
            <th scope="col" class="org-left">値</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">画面サイズ</td>
            <td class="org-left">6.13 インチ (横 1 : 縦 2)</td>
          </tr>

          <tr>
            <td class="org-left">解像度</td>
            <td class="org-left">824x1,648 (300 dpi)</td>
          </tr>

          <tr>
            <td class="org-left">ROM</td>
            <td class="org-left">128 GB</td>
          </tr>

          <tr>
            <td class="org-left">RAM</td>
            <td class="org-left">6 GB</td>
          </tr>

          <tr>
            <td class="org-left">重量</td>
            <td class="org-left">170g</td>
          </tr>

          <tr>
            <td class="org-left">バッテリー</td>
            <td class="org-left">3950 mAh</td>
          </tr>

          <tr>
            <td class="org-left">防水</td>
            <td class="org-left">無し</td>
          </tr>
        </tbody>
      </table>

      <p>※ Wifi のみ<br /></p>

      <h2 id="使用感"><a href="#使用感">使用感</a></h2>
      <h3 id="ハード面"><a href="#ハード面">ハード面</a></h3>
      <p>バッテリー以外は問題無さそうです。<br /></p>

      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">項目</th>
            <th scope="col" class="org-left">一言</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">バッテリー</td>
            <td class="org-left">5 時間持つ (らしい)</td>
          </tr>

          <tr>
            <td class="org-left">画像表示</td>
            <td class="org-left">縮小されて汚い</td>
          </tr>

          <tr>
            <td class="org-left">スピーカー</td>
            <td class="org-left">長時間聴くには堪えない</td>
          </tr>

          <tr>
            <td class="org-left">キーボード接続</td>
            <td class="org-left">TODO</td>
          </tr>

          <tr>
            <td class="org-left">Bluetooth 接続</td>
            <td class="org-left">Shokz の物理ボタンが動作する ※</td>
          </tr>
        </tbody>
      </table>

      <p>※ ただしソフトが再生切り替えボタンに対応していない？<br /></p>

      <h3 id="メディア"><a href="#メディア">メディア</a></h3>
      <p>テキストには強いのですが、音声関連はイマイチでした。<br /></p>

      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">項目</th>
            <th scope="col" class="org-left">一言</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">IME</td>
            <td class="org-left">gboard でフリック入力</td>
          </tr>

          <tr>
            <td class="org-left">読み上げ</td>
            <td class="org-left">やりにくい (Talkback)</td>
          </tr>

          <tr>
            <td class="org-left">音声入力</td>
            <td class="org-left">TODO</td>
          </tr>
        </tbody>
      </table>

      <h3 id="アプリケーション"><a href="#アプリケーション">アプリケーション</a></h3>
      <p>
        読み上げは快適ではなかったため、テキストに専念しました。特に
        <a href="https://github.com/plateaukao/einkbro">einkbro</a>
        のおかげで快適にブラウジングできるようになり、活用の幅が広がりました。<br />
      </p>

      <table>
        <colgroup>
          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">用途</th>
            <th scope="col" class="org-left">使用アプリ</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">Web ブラウジング</td>
            <td class="org-left"><a href="https://github.com/plateaukao/einkbro">einkbro</a></td>
          </tr>

          <tr>
            <td class="org-left">Web 小説</td>
            <td class="org-left"><a href="https://makimaru.r401.net/">巻丸3</a></td>
          </tr>

          <tr>
            <td class="org-left">epub</td>
            <td class="org-left">Boox Reader</td>
          </tr>

          <tr>
            <td class="org-left">Kindle</td>
            <td class="org-left">Kindle</td>
          </tr>

          <tr>
            <td class="org-left">Termux</td>
            <td class="org-left">Termux</td>
          </tr>
        </tbody>
      </table>

      <h2 id="感想"><a href="#感想">感想</a></h2>
      <p>
        とにかくナビゲーションが軽快で、文字の表示も美しいです。 Web
        記事や小説類は、すべてこの端末で読むことになりそうです。<br />
      </p>

      <p>
        スピーカーは良くありません。読み上げもやりづらく、テキスト表示の専用デバイスとして使うことにします。動画や音声には
        iPad を使います。<br />
      </p>
    </main>
    <footer role="contentinfo">
      <p>Styled with <a href="https://simplecss.org/">Simple.css</a></p>
      <div><a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div>
    </footer>
  </body>
</html>
